<%@page contentType="text/html" pageEncoding="UTF-8"%>
<%@taglib prefix="t" tagdir="/WEB-INF/tags"%>
<%@taglib uri="http://www.springframework.org/tags" prefix="spring"%>
<t:wrapper>
    <jsp:attribute name="language">lang="ru"</jsp:attribute>
    <jsp:attribute name="header">
    <title>Политика конфиденциальности - ExamClouds</title>
    <link rel="alternate" hreflang="ru" href="https://www.examclouds.com/ru/privacy">
    <link rel="alternate" hreflang="en" href="https://www.examclouds.com/privacy">
    <link rel="alternate" hreflang="x-default" href="https://www.examclouds.com/privacy">
    <link rel="canonical" href="https://www.examclouds.com/privacy">
    <meta name="Description" content="Описание политики конфиденциальности - ExamClouds">
 </jsp:attribute>
    <jsp:body>
        <h1>Политика в отношении обработки персональных данных</h1>
            <div>
                <div>
                    <h5>1. Общие положения</h5>
                    <div>Настоящая политика обработки персональных данных определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые <span id="genName" data-scroll-to="#privacyName" class="link mark">ExamClouds</span> (далее – Оператор).</div>
                    <div>
                        <div>1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</div>
                        <div>1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта <span data-scroll-to="#prefixURL" class="link mark">httpsː//www.examclouds.com</span>.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>2. Основные понятия, используемые в Политике</h5>
                    <div>
                        <div>2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники.</div>
                        <div>2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).</div>
                        <div>2.3. Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу <span data-scroll-to="#prefixURL" class="link mark">httpsː//www.examclouds.com</span>.</div>
                        <div>2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств.</div>
                        <div>2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных.</div>
                        <div>2.6. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</div>
                        <div>2.7. Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</div>
                        <div>2.8. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта <span data-scroll-to="#prefixURL" class="link mark">httpsː//www.examclouds.com</span>.</div>
                        <div>2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, - персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных (далее - персональные данные, разрешенные для распространения).</div>
                        <div>2.10. Пользователь – любой посетитель веб-сайта <span data-scroll-to="#prefixURL" class="link mark">httpsː//www.examclouds.com</span>.</div>
                        <div>2.11. Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.</div>
                        <div>2.12. Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом.</div>
                        <div>2.13. Трансграничная передача персональных данных – передача персональных данных на территорию иностранного государства органу власти иностранного государства, иностранному физическому или иностранному юридическому лицу.</div>
                        <div>2.14. Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>3. Основные права и обязанности Оператора</h5>
                    <div>
                        <div>3.1. Оператор имеет право:</div>
                        <div>– получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;</div>
                        <div>3.2. Оператор обязан:</div>
                        <div>– предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных;</div>
                        <div>– публиковать или иным образом обеспечивать неограниченный доступ к настоящей Политике в отношении обработки персональных данных;</div>
                        <div>– принимать правовые, организационные и технические меры для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных;</div>
                        <div>– прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных;</div>
                        <div>– исполнять иные обязанности, предусмотренные Законом о персональных данных.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>4. Основные права и обязанности субъектов персональных данных</h5>
                    <div>
                        <div>4.1. Субъекты персональных данных имеют право:</div>
                        <div>– получать информацию, касающуюся обработки его персональных данных. Сведения предоставляются субъекту персональных данных Оператором в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных данных.</div>
                        <div>– требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав;</div>
                        <div>– выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг;</div>
                        <div>– на отзыв согласия на обработку персональных данных;</div>
                        <div>– обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных;</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>5. Оператор может обрабатывать следующие персональные данные Пользователя</h5>
                    <div id="generatedDataCollecting">
                        <div>5.1. <mark>Адрес электронной почты;</mark></div>
                        <div>5.2. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики (Гугл Аналитика и других).</div>
                        <div>5.3. Вышеперечисленные данные далее по тексту Политики объединены общим понятием Персональные данные.</div>
                        <div>5.4. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, интимной жизни, Оператором не осуществляется.</div>
                        <div>5.5. Согласие Пользователя на обработку персональных данных, разрешенных для распространения, оформляется отдельно от других согласий на обработку его персональных данных.</div>
                        <div>5.5.1. Согласие на обработку персональных данных, разрешенных для распространения, Пользователь предоставляет Оператору непосредственно.</div>
                        <div>5.5.2. Оператор обязан в срок не позднее трех рабочих дней с момента получения указанного согласия Пользователя опубликовать информацию об условиях обработки, о наличии запретов и условий на обработку неограниченным кругом лиц персональных данных, разрешенных для распространения.</div>
                        <div>5.5.3. Передача (распространение, предоставление, доступ) персональных данных, разрешенных субъектом персональных данных для распространения, должна быть прекращена в любое время по требованию субъекта персональных данных. Данное требование должно включать в себя фамилию, имя, отчество (при наличии), контактную информацию (номер телефона, адрес электронной почты или почтовый адрес) субъекта персональных данных, а также перечень персональных данных, обработка которых подлежит прекращению. Указанные в данном требовании персональные данные могут обрабатываться только Оператором, которому оно направлено.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>6. Принципы обработки персональных данных</h5>
                    <div>
                        <div>6.1. Обработка персональных данных осуществляется на законной и справедливой основе.</div>
                        <div>6.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных.</div>
                        <div>6.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой.</div>
                        <div>6.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки.</div>
                        <div>6.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки.</div>
                        <div>6.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных.</div>
                        <div>6.7. Хранение персональных данных осуществляется в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных. Обрабатываемые персональные данные уничтожаются либо обезличиваются по достижении целей обработки или в случае утраты необходимости в достижении этих целей, если иное не предусмотрено федеральным законом.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>7. Цели обработки персональных данных</h5>
                    <div>
                        <div>7.1. Цель обработки персональных данных Пользователя:</div>
                        <div id="generatedProcessingTargets">
                            <div>– <mark>информирование Пользователя посредством отправки электронных писем</mark>;</div>
                            <div>– <mark>предоставление доступа Пользователю к сервисам, информации и/или материалам, содержащимся на веб-сайте httpsː//www.examclouds.com;</mark></div>
                        </div>
                        <div>7.2. Также Оператор имеет право направлять Пользователю уведомления о новых продуктах и услугах, специальных предложениях и различных событиях. Пользователь всегда может отказаться от получения информационных сообщений, направив Оператору письмо на адрес электронной почты <span data-scroll-to="#privacyEmail" class="link mark">tatyana.milkina@gmail.com</span> с пометкой «Отказ от уведомлений о новых продуктах и услугах и специальных предложениях».</div>
                        <div>7.3. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания. </div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>8. Правовые основания обработки персональных данных</h5>
                    <div>
                        <div>8.1. Оператор обрабатывает персональные данные Пользователя только в случае их заполнения и/или отправки Пользователем самостоятельно через специальные формы, расположенные на сайте <span data-scroll-to="#prefixURL" class="link mark">httpsː//www.examclouds.com</span> или направленные Оператору посредством электронной почты. Заполняя соответствующие формы и/или отправляя свои персональные данные Оператору, Пользователь выражает свое согласие с данной Политикой.</div>
                        <div>8.2. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript).</div>
                        <div>8.3. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных и дает согласие свободно, своей волей и в своем интересе.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>9. Условия обработки персональных данных</h5>
                    <div>
                        <div>9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных.</div>
                        <div>9.2. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем.</div>
                        <div>9.3. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных.</div>
                        <div>9.4. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее – общедоступные персональные данные).</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>10. Порядок сбора, хранения, передачи и других видов обработки персональных данных</h5>
                    <div class="descr">Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.</div>
                    <div>
                        <div>10.1. Оператор обеспечивает сохранность персональных данных и принимает все возможные меры, исключающие доступ к персональным данным неуполномоченных лиц.</div>
                        <div>10.2. Персональные данные Пользователя никогда, ни при каких условиях не будут переданы третьим лицам, за исключением случаев, связанных с исполнением действующего законодательства либо в случае, если субъектом персональных данных дано согласие Оператору на передачу данных третьему лицу для исполнения обязательств по гражданско-правовому договору.</div>
                        <div>10.3. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора <span data-scroll-to="#privacyEmail" class="link mark">tatyana.milkina@gmail.com</span> с пометкой «Актуализация персональных данных».</div>
                        <div>10.4. Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством.<br>Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора <span data-scroll-to="#privacyEmail" class="link mark">tatyana.milkina@gmail.com</span> с пометкой «Отзыв согласия на обработку персональных данных».</div>
                        <div>10.5. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или Пользователь обязан самостоятельно своевременно ознакомиться с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг.</div>
                        <div>10.6. Оператор при обработке персональных данных обеспечивает конфиденциальность персональных данных.</div>
                        <div>10.7. Оператор осуществляет хранение персональных данных в форме, позволяющей определить субъекта персональных данных, не дольше, чем этого требуют цели обработки персональных данных, если срок хранения персональных данных не установлен федеральным законом, договором, стороной которого, выгодоприобретателем или поручителем по которому является субъект персональных данных.</div>
                        <div>10.8. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных или отзыв согласия субъектом персональных данных, а также выявление неправомерной обработки персональных данных.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>11. Перечень действий, производимых Оператором с полученными персональными данными</h5>
                    <div>
                        <div>11.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных.</div>
                        <div>11.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>12. Трансграничная передача персональных данных</h5>
                    <div>
                        <div>12.1. Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных.</div>
                        <div>12.2. Трансграничная передача персональных данных на территории иностранных государств, не отвечающих вышеуказанным требованиям, может осуществляться только в случае наличия согласия в письменной форме субъекта персональных данных на трансграничную передачу его персональных данных и/или исполнения договора, стороной которого является субъект персональных данных.</div>
                    </div>
                </div>
            </div>
            <div>
                <div>
                    <h5>13. Конфиденциальность персональных данных</h5>
                    <div class="descr">Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных.</div>
                </div>
            </div>
            <div>
                <div>
                    <h5>14. Заключительные положения</h5>
                    <div>
                        <div>14.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты <span data-scroll-to="#privacyEmail" class="link mark">tatyana.milkina@gmail.com</span>.</div>
                        <div>14.2. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует бессрочно до замены ее новой версией.</div>
                        <div>14.3. Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу <span id="genURLLink" data-scroll-to="#prefixURLLink" class="link mark">httpsː//www.examclouds.com/ru/privacy/</span>.</div>
                    </div>
                </div>
            </div>
    </jsp:body>
</t:wrapper>